<h2 align='center'>DWM LAB1</h2>

# V.SHIVA KUMAR CHARY    SEC-04    2000031041

PRELAB:
1. List out the steps to connect the database to Python.
A) 1.Import mysql.connector module
   2. Create the connection object.
   3. Create the cursor object
   4. Execute the query
   
2. How do you convert a pandas data frame into MySQL table using pymysql,
sqlalchemy libraries?
A) 1. import required libraries i.e., pandas, pymysql, sqlalchemy
   2. import dataset
   3. Create SQLAlchemy engine to connect to MySQL Database
   4. Convert dataframe to sql table  using to_sql() method

In [1]:
#Inlab 1a
import pandas as pd
import pymysql
from sqlalchemy import create_engine

#Importing Data Sets
df = pd.read_csv('lab1in.csv')
df

   Student_id  Age  Grade  marks
0       17004   10      5     30
1       17003   11      5     89
2       17002   11      5     67
3       17001   11      5     50
4       17005   10      5     45
5       17006   10      5     72
6       17007   11      5     92
7       17008   10      5     29
8       17009   11      5     85
9       17010   10      5     65

In [5]:
tableName   = "student"

sqlEngine       = create_engine('mysql+pymysql://root:Shiva_789@localhost:3306/dwm', pool_recycle=3600)

dbConnection    = sqlEngine.connect()

try:

    frame = df.to_sql(tableName, dbConnection, if_exists='fail');

except ValueError as vx:

    print(vx)

except Exception as ex:   

    print(ex)

else:

    print("Table %s created successfully."%tableName);   

finally:

    dbConnection.close()

Table 'student' already exists.

<b>Inlab1 - b <b>
<img src="lab1inlab2_solution.png" alt="INLAB1_2 Solution">

<h3> Post Lab </h3>

In [6]:
#1. Fetch the number of students in the database.
df.shape[0]

10

In [7]:
#2. Querying the sum of marks scored by every student
print(df['marks'].sum())

624

In [8]:
#3. Query the average marks of the student.
print(df['marks'].mean())

62.4

In [9]:
#4. Display the names of top 10 students having highest grades
df['marks'].sort_values(ascending=False)

6    92
1    89
8    85
5    72
2    67
9    65
3    50
4    45
0    30
7    29
Name: marks, dtype: int64

In [10]:
#5. Display the names of the last ten students having lowest grades
df['marks'].sort_values(ascending=True)

7    29
0    30
4    45
3    50
9    65
2    67
5    72
8    85
1    89
6    92
Name: marks, dtype: int64